import * as dns from 'dns';
import { NestFactory } from '@nestjs/core';
import { AppModule } from './app.module';

// error fix
dns.setServers(['8.8.8.8', '8.8.4.4']);

async function bootstrap() {
  const app = await NestFactory.create(AppModule);
  await app.listen(process.env.PORT ?? 3000);
}
bootstrap();

// მოგესალმებით თქვენი დავალებაა შექმნათ ახალი ნესტის პროექტი და დააინტეგრიროთ შემდეგი ფუნქციები.

// 1) შექმენით იუზერების ქრადი და ბაზაში დაამატეთ 150_000 იუზერი ფეიქეირს გამოყენებით.
// 2) დაამატეთ ლოგირების მექანიზმი, ნახეთ რა დრო ჭირდება თითოეულ რექუესთს. იუზერების წაკითხვაზე დაამატეთ ქეშირება რომ უფრო დააოპტიმიზიროთ თქვენი რისფონს თაიმი.
// 3) დაამატეთ ახალი ენდფოინთი რომელიც დაგიბრუნებთ სულ რამდენი იუზრია ბაზაში. /total-users
// 4) ასაკზე დაადეთ ინდექსი და დაამატეთ ახალი ენდფოინთი რომესაც გადასცემთ ასაკს, თუ მხოლოდ ასაკი გადაეცით დაგიბრუნებთ იმ ასაკის ადამიანებს, თუ გადაეცით ageFrom და ageTo შესაბამისად გაფილტრავს ასაკის მიხედვით იუზერებს და დააბრუნებს. ასევე გაფილტერთ gender=m სქესის მიხედვით ფილტრი. დაამატეთ სახელის მიხედვით სერჩი, regex ის გამოყენებით.
// 5)  დაამტეთ იუზერების რესურსზე ფეჯინეიშენი, შეზღუდეთ ზედა/ქვედა ლიმიტი.
// მინიშნება უნდა გამოიყენოთ model.find().skip().limit() ეს ორი მეთოდი შიგნით რაღაც უნდა ჩაწეროთ რიცხცვები ეგ თქვენზე მომინდია

// რეფერენსი: https://drive.google.com/file/d/1T7kIpOq5jiyAW6G8hxXf5ONb3yUWTCsk/view?usp=drive_link
// https://github.com/Datodia/Gita-backend-3/commit/c6636606f962556bfd063e54551cb8090e2bbc7b
